Revit 2027 API
ParameterUtils.DownloadParameter Method
Overload List
Name | Description
DownloadParameter(Document, ParameterDownloadOptions, ForgeTypeId) | Obsolete.
 Create a shared parameter element in the given document according to a parameter definition downloaded from the Parameters Service.
DownloadParameter(Document, ParameterDownloadOptions, ForgeTypeId, String) |  Create a shared parameter element in the given document according to a parameter definition downloaded from the Parameters Service.
Top
See Also
Reference
ParameterUtils Class
Autodesk.Revit.DB Namespace